import "../../styles/delivery.css"; // Подключаем отдельный CSS

const DeliveryPayment = () => {
  return (
    <div className="about-container">
      {/* Доставка */}
      <h1>Доставка</h1>
      <p>Ми дбаємо про швидку та надійну доставку вашого замовлення.</p>
      <p>З любов’ю та турботою спаковуємо кожне замовлення, щоб ваші улюблені косметичні засоби потрапили до вас якомога швидше та безпечніше.</p>
      <p>Ви отримаєте своє замовлення вже через 1-2 дні після його оформлення.</p>
      <p className="warning">
        Шановні клієнти! Просимо перевіряти наявність замовлених позицій перед підписанням ТТН. Після отримання товару компанія не несе відповідальності за його наявність у вашому замовленні.
      </p>

      {/* Оплата */}
      <h2>Оплата</h2>
      <p>Оплата здійснюється на розрахунковий рахунок.</p>
      <p>Для додаткової інформації телефонуйте, пишіть:</p>
      <div className="socials">
        <a href="tel:+380938190535">моб.: 093 819 05 35</a>
        <a href="tel:+380633003030">моб.: 063 300 30 30</a>
        <a href="mailto:info@elangel-cosmetics.com.ua">email: info@elangel-cosmetics.com.ua</a>
      </div>
    </div>
  );
};

export default DeliveryPayment;
